#include<stdio.h>

int cal(int x) // 각 숫자의 개수 계산 함수
{
	int num = 0;

	if (x < 10) // 한 자리 수
		num = x;
	else if (x < 100) // 두 자리 수
		num = 9 + (x - 10 + 1) * 2;
	else if (x < 1000) // 세 자리 수
		num = 9 + 180 + (x - 100 + 1) * 3;
	else if (x < 10000) // 네 자리 수
		num = 9 + 180 + 2700 + (x - 1000 + 1) * 4;
	else if (x < 100000) // 다섯 자리 수
		num = 9 + 180 + 2700 + 36000 + (x - 10000 + 1) * 5;
	else if (x < 1000000) // 여섯 자리 수
		num = 9 + 180 + 2700 + 36000 + 450000 + (x - 100000 + 1) * 6;
	else if (x < 10000000) // 일곱 자리 수
		num = 9 + 180 + 2700 + 36000 + 450000 + 5400000 + (x - 1000000 + 1) * 7;
	else if (x < 100000000) // 여덟 자리 수
		num = 9 + 180 + 2700 + 36000 + 450000 + 5400000 + 63000000 + (x - 10000000 + 1) * 8;
	else // 100000000
		num = 9 + 180 + 2700 + 36000 + 450000 + 5400000 + 63000000 + 720000000 + 9;

	return num;
}

int main()
{
	int N;

	scanf_s("%d", &N);

	printf("%d", cal(N));
}